{
  "question-1": "What is the publication year of the study?",
  "question-2": "Which dataset(s) were used in the study? (List all)",
  "question-3": "What is the size of each dataset used (number of instances)?",
  "question-4": "What machine learning technique(s) were employed in the study? (List all)",
  "question-5": "For each machine learning technique used:\na. What was the overall prediction accuracy?\nb. What was the precision?\nc. What was the recall?\nd. What was the F1-score?\ne. What was the AUC-ROC value (if reported)?",
  "question-6": "What software metrics were used as features for prediction? (List all)",
  "question-7": "For each software metric used:\na. What was its individual predictive power (if reported)?\nb. Was it ranked or weighted in terms of importance? If so, what was its rank or weight?",
  "question-8": "What performance measures were used to evaluate the model(s)? (List all)",
  "question-9": "Were any dimensionality reduction techniques (e.g., PCA) used? If so, which ones?",
  "question-10": "Were any ensemble methods used? If so, which ones?",
  "question-11": "Was cross-validation used? If so, what type and how many folds?",
  "question-12": "What was the ratio of defective to non-defective modules in each dataset used?",
  "question-13": "Were any data preprocessing techniques applied? If so, which ones?",
  "question-14": "Was feature selection performed? If so, what method was used?",
  "question-15": "Were any comparative analyses performed with other studies or techniques? If so, with which ones?",
  "question-16": "What programming language or tool was used to implement the machine learning models?",
  "question-17": "Were there any specific strengths or weaknesses identified for each machine learning technique used?",
  "question-18": "Was the study focused on within-project or cross-project defect prediction?",
  "question-19": "Were any novel or hybrid techniques proposed? If so, describe them briefly.",
  "question-20": "What conclusions were drawn about the effectiveness of different machine learning techniques?",
  "question-21": "Were any specific challenges or limitations mentioned regarding the use of machine learning for bug prediction?",
  "question-22": "Was there any analysis of computational complexity or runtime performance of the techniques used?",
  "question-23": "Were any specific recommendations made for future research in this area?",
  "question-24": "Was transfer learning or domain adaptation considered in the study?",
  "question-25": "Were any visualizations or graphical representations of the results provided? If so, what types?",
  "question-26": "Was there any discussion on the interpretability of the machine learning models used?",
  "question-27": "Were any industrial or real-world applications of the techniques discussed?",
  "question-28": "Was there any analysis of the cost-effectiveness of the bug prediction approach?",
  "question-29": "Were any comparisons made between traditional software metrics and more advanced or domain-specific metrics?",
  "question-30": "Was there any discussion on the generalizability of the results to other software projects or domains?"
}
